BAS for accounting/src/Catalogs/СМП_УчетныеЗаписиБанков/СМП_УчетныеЗаписиБанков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СМП_УчетныеЗаписиБанков</name>
  <attributes>
    <name>Банк</name>
    <type>
      <types>EnumRef.СМП_ПоддерживаемыеИнтеграцииСБанками</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДоступаДляНовыхКонтрагентов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторРегламентногоЗадания</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьРегламентныеЗадания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодключаемаяОбработка</name>
    <type>
      <types>CatalogRef.ДополнительныеОтчетыИОбработки</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьНенайденныеЭлементы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Токен</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДляНовыхКонтрагентов</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДССписаниеСРасчетногоСчета</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДСПоступлениеНаРасчетныйСчет</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроводитьПриЗагрузкеСписаниеСРасчетногоСчета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроводитьПриЗагрузкеПоступлениеНаРасчетныйСчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Кодировка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФайлВыгрузки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлЗагрузки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РасширениеФайлаИмпорта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

BAS for accounting/src/Enums/СМП_ПоддерживаемыеИнтеграцииСБанками/СМП_ПоддерживаемыеИнтеграцииСБанками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СМП_ПоддерживаемыеИнтеграцииСБанками</name>
  <enumValues>
    <name>ПриватБанк</name>
  </enumValues>
  <enumValues>
    <name>МОНОБанк</name>
  </enumValues>
  <enumValues>
    <name>ПодключаемаяОбработка</name>
  </enumValues>
</mdclass:Enum>

BAS for accounting/src/Catalogs/СМП_УчетныеЗаписиБанков/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Обработчик подсистемы запрета редактирования реквизитов объектов
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов
	Если Объект.Ссылка.Пустая() Тогда
		ЗаполнитьЗначенияСвойств(Объект, Параметры);
	КонецЕсли;
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// Обработчик подсистемы запрета редактирования реквизитов объектов
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ВыполнитьОбмен(Команда)
	
	ДлительнаяОперация = НачатьВыполнениеНаСервереОбмена();
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультат", ЭтотОбъект);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция НачатьВыполнениеНаСервереОбмена()
	
	//ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение = Ложь;
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Обмен с банком (" + Объект.Ссылка + ")";
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	
	//Возврат ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения, "СМП_РаботаСБанкамиСервер.ОбменСБанком", Объект.Ссылка);
	Возврат ДлительныеОперации.ВыполнитьВФоне(ПараметрыВыполнения, "СМП_РаботаСБанкамиСервер.ОбменСБанком", Объект.Ссылка);
	
КонецФункции

&НаСервере
Функция ПолучитьНомерСчета()
	
	Возврат Объект.БанковскийСчет.НомерСчета;
	
КонецФункции

&НаКлиенте
Процедура БанкПриИзменении(Элемент)
	
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовогоКонтрагентаПриЗагрузкеВыпискиПриИзменении(Элемент)
	
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементов()
	
	ЭтоПриватБанкAPI = Объект.Банк = Перечисления.СМП_ПоддерживаемыеИнтеграцииСБанками.ПриватБанк;
	ЭтоМоноБанкAPI = Объект.Банк = Перечисления.СМП_ПоддерживаемыеИнтеграцииСБанками.МОНОБанк;
	ЭтоФайловаяВыписка = Объект.Банк = Перечисления.СМП_ПоддерживаемыеИнтеграцииСБанками.ПодключаемаяОбработка;
	
	Элементы.ПодключаемаяОбработка.Видимость = ЭтоФайловаяВыписка;
	Элементы.ДекорацияРаботаСБанкамиПриватБанкАРІ.Видимость = ЭтоПриватБанкAPI;
	Элементы.ДекорацияРаботаСБанкамиМОНОБанкАРІ.Видимость = ЭтоМоноБанкAPI;
	Элементы.ИД.Видимость = ЭтоПриватБанкAPI; // Или ЭтоМоноБанкAPI;
	Элементы.Токен.Видимость = ЭтоПриватБанкAPI; // Или ЭтоМоноБанкAPI;
	Элементы.ГруппаРегламентноеЗадание.Видимость = ЭтоПриватБанкAPI; // Или ЭтоМоноБанкAPI;
	Элементы.ДекорацияРазработкаМОНО.Видимость = ЭтоМоноБанкAPI;
	//Элементы.СоздаватьНенайденныеЭлементы.Доступность = Объект.ИспользоватьРегламентныеЗадания;
	Элементы.ГруппаДоступаДляНовыхКонтрагентов.Доступность = Объект.ИспользоватьРегламентныеЗадания;
	
	//Не работает механизм - постоянно выдает сообщение, что нет лицензии, хотя подсистема есть
	Если ЭтоПриватБанкAPI И Не ОбщегоНазначения.ПодсистемаСуществует("СМП_simplyUNF.РаботаСБанками.ПриватБанк") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не обнаружена лицензия на использование интеграции с банком ПриватБанк средствами API!';
													|uk = 'Не знайдена ліцензія на використання інтеграції з банком ПриватБанк методами API!'"));
	КонецЕсли;
	
	//Если ЭтоМоноБанкAPI И Не ОбщегоНазначения.ПодсистемаСуществует("СМП_simplyUNF.РаботаСБанками.МОНОБанк") Тогда
	//	ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не обнаружена лицензия на использование интеграции с банком МОНО средствами API!';
	//												|uk = 'Не знайдена ліцензія на використання інтеграції з банком МОНО методами API!'"));
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультат(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		Сообщить(Результат.КраткоеПредставлениеОшибки);
	Иначе
		
		//РезультатРаботы = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		//Если ЗначениеЗаполнено(РезультатРаботы.Ошибка) Тогда
		//	Сообщить(РезультатРаботы.Ошибка);
		//Иначе
		//	ЭтотОбъект.Прочитать();
		//	Элементы.Товары.Обновить();
		//КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры 

#Область РегламентноеЗадание

&НаКлиенте
Процедура НастроитьРасписаниеОбмена(Команда)
	
	НастроитьРасписание(РасписаниеРегламентногоЗаданияОбмена, Элементы.НастроитьРасписание, "РасписаниеРегламентногоЗаданияОбмена");
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьРасписание(Расписание, Элемент, СтрокаРасписания)
	
	ВыполнитьНастройкуРасписания(Расписание, Элемент, СтрокаРасписания);
	Элемент.Заголовок = УстановитьНадписьРасписания(Расписание, СтрокаРасписания);
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьНастройкуРасписания(РасписаниеЗадания, Элемент, СтрокаРасписания)
	
	Если РасписаниеЗадания = Неопределено Тогда
		РасписаниеЗадания = Новый РасписаниеРегламентногоЗадания;
	КонецЕсли;
	
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(РасписаниеЗадания);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыполнитьНастройкуРасписанияЗавершение", ЭтотОбъект, Новый Структура("ЭлементФормы, СтрокаРасписания, Расписание", Элемент, СтрокаРасписания, РасписаниеЗадания));
	Диалог.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьНастройкуРасписанияЗавершение(Расписание, ДополнительныеПараметры) Экспорт
	
	Если Расписание = Неопределено Тогда
		Расписание = РасписаниеРегламентногоЗаданияОбмена;
	КонецЕсли;
	
	ЭтотОбъект[ДополнительныеПараметры.СтрокаРасписания] = Расписание;
	ДополнительныеПараметры.ЭлементФормы.Заголовок = УстановитьНадписьРасписания(Расписание, ЭтотОбъект[ДополнительныеПараметры.СтрокаРасписания]);
	РасписаниеРегламентногоЗаданияОбмена = Расписание;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьРегламентныеЗаданияПриИзменении(Элемент)
	
	ПриИзмененииИспользоватьРегламентныеЗадания();
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Функция УстановитьНадписьРасписания(Расписание, СтрокаРасписания)
	
	Если Расписание = Неопределено Тогда
		ТекстЗаголовка = НСтр("ru='Настроить расписание обмена'");
	Иначе
		ТекстЗаголовка = Расписание;
	КонецЕсли;
	
	Возврат ТекстЗаголовка;
	
КонецФункции

&НаКлиенте
Процедура ПриИзмененииИспользоватьРегламентныеЗадания()
	
	УстановитьДоступностьРасписанияОбмена();
	
	Если Объект.ИспользоватьРегламентныеЗадания Тогда
		
		ВыполнитьНастройкуРасписания(РасписаниеРегламентногоЗаданияОбмена, Элементы.НастроитьРасписание, "ИнтервалОбменаССайтом");
		Элементы.НастроитьРасписание.Заголовок = УстановитьНадписьРасписания(РасписаниеРегламентногоЗаданияОбмена, "ИнтервалОбменаССайтом");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьРасписанияОбмена()
	Элементы.НастроитьРасписание.Доступность = Объект.ИспользоватьРегламентныеЗадания;
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Задание = ДополнительныеОтчетыИОбработкиРегламентныеЗаданияВМоделиСервиса.НайтиЗадание(Объект.ИдентификаторРегламентногоЗадания);
	
	Если Не Задание = Неопределено Тогда
		
		Если ТипЗнч(Задание.Расписание) = Тип("РасписаниеРегламентногоЗадания") Тогда
			РасписаниеРегламентногоЗаданияОбмена = Задание.Расписание;
		ИначеЕсли ТипЗнч(Задание.Расписание) = Тип("ХранилищеЗначения") Тогда
			РасписаниеРегламентногоЗаданияОбмена = Задание.Расписание.Получить();
		Иначе
			РасписаниеРегламентногоЗаданияОбмена = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Запрос = Новый Запрос;
	Запрос.текст = "ВЫБРАТЬ
	               |	СМП_УчетныеЗаписиБанков.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.СМП_УчетныеЗаписиБанков КАК СМП_УчетныеЗаписиБанков
	               |ГДЕ
	               |	СМП_УчетныеЗаписиБанков.Ссылка <> &Ссылка
	               |	И СМП_УчетныеЗаписиБанков.БанковскийСчет = &БанковскийСчет";
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("БанковскийСчет", Объект.БанковскийСчет);
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Отказ = Истина;
		Сообщить(НСтр("ru='Настройка для данного счета уже существует!';uk='Налаштування для даного рахунку вже існує!'"));
	КонецЕсли;

	
	Если Не Отказ Тогда
		Если ТекущийОбъект.ИспользоватьРегламентныеЗадания И РасписаниеРегламентногоЗаданияОбмена = Неопределено Тогда
			ТекущийОбъект.ИспользоватьРегламентныеЗадания = Ложь;
		КонецЕсли;
		
		Задание = ДополнительныеОтчетыИОбработкиРегламентныеЗаданияВМоделиСервиса.НайтиЗадание(ТекущийОбъект.ИдентификаторРегламентногоЗадания);
		Если ТекущийОбъект.ИспользоватьРегламентныеЗадания Тогда
			
			Если Задание = Неопределено Тогда
				ИдентификаторЗадания = СоздатьНовоеЗадание(ТекущийОбъект.Код, ТекущийОбъект.Наименование, РасписаниеРегламентногоЗаданияОбмена);
				ТекущийОбъект.ИдентификаторРегламентногоЗадания = ИдентификаторЗадания;
			Иначе
				УстановитьПараметрыЗадания(Задание, Истина, ТекущийОбъект.Код, ТекущийОбъект.Наименование, РасписаниеРегламентногоЗаданияОбмена);
			КонецЕсли;
			
		Иначе
			
			Если Задание <> Неопределено Тогда
				ДополнительныеОтчетыИОбработкиРегламентныеЗаданияВМоделиСервиса.УдалитьЗадание(Задание);
			КонецЕсли;
			ТекущийОбъект.ИдентификаторРегламентногоЗадания = Неопределено;
			
		КонецЕсли;
	КонецЕсли;

		
КонецПроцедуры

&НаСервере
// Создает новое задание очереди заданий.
//
// Возвращаемое значение: УникальныйИдентификатор.
//
Функция СоздатьНовоеЗадание(КодНастройки, НаименованиеНастройки, Расписание, ПолныйПарсинг = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПараметрыЗадания = Новый Массив;
	ПараметрыЗадания.Добавить(КодНастройки);
	
	ИдентификаторРегламентногоЗадания = Неопределено;
	Задание = РегламентныеЗадания.СоздатьРегламентноеЗадание("СМП_ОбменСБанкамиAPI");
	Задание.Использование = Истина;
	Задание.Ключ = Строка(Новый УникальныйИдентификатор);
	Задание.Наименование = НаименованиеНастройки;
	Задание.Параметры = ПараметрыЗадания;
	Задание.Расписание = Расписание;
	Задание.Записать();
	
	ИдентификаторРегламентногоЗадания = Задание.УникальныйИдентификатор;
	
	Возврат ИдентификаторРегламентногоЗадания;
	
КонецФункции

&НаСервере
// Устанавливает параметры регламентного задания или задания очереди заданий.
//
// Параметры:
//  Задание - СправочникСсылка.ОчередьЗаданийОбластейДанных,
//  Использование - булево, флаг использования регламентного задания,
//  КодУзла - Строка - Код узла плана обмена
//  НаименованиеУзла - Строка - Наименование узла плана обмена
//  Расписание - РасписаниеРегламентногоЗадания.
//
Процедура УстановитьПараметрыЗадания(Задание, Использование, КодНастройки, НаименованиеНастройки, Расписание) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПараметрыЗадания = Новый Массив;
	ПараметрыЗадания.Добавить(КодНастройки);
	
	Задание.Использование = Истина;
	Задание.Ключ = Строка(Новый УникальныйИдентификатор);
	Задание.Наименование = НаименованиеНастройки;
	Задание.Параметры = ПараметрыЗадания;
	Задание.Расписание = Расписание;
	Задание.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСтандартныхПодсистем

// СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов
&НаКлиенте
Процедура Подключаемый_РазрешитьРедактированиеРеквизитовОбъекта(Команда)
	
	ЗапретРедактированияРеквизитовОбъектовКлиент.РазрешитьРедактированиеРеквизитовОбъекта(ЭтотОбъект);
	
КонецПроцедуры // Подключаемый_РазрешитьРедактированиеРеквизитовОбъекта()

&НаКлиенте
Процедура ФайлВыгрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ВыборФайлаДляВыгрузкиИЗагрузки(Элемент, НСтр("ru='выгрузки';uk='вивантаження'"));
КонецПроцедуры

&НаКлиенте
Процедура ФайлЗагрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ВыборФайлаДляВыгрузкиИЗагрузки(Элемент, НСтр("ru='загрузки';uk='завантаження'"));
КонецПроцедуры
// Конец СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов
&НаКлиенте
Процедура ВыборФайлаДляВыгрузкиИЗагрузки(Элемент, Режим) Экспорт
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогВыбора.Фильтр                      = НСтр("ru='" + Объект.РасширениеФайлаИмпорта + " файл';uk='" + Объект.РасширениеФайлаИмпорта + " файл'") + " (*." + Объект.РасширениеФайлаИмпорта + ")|*." + Объект.РасширениеФайлаИмпорта;
	ДиалогВыбора.Заголовок                   = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='Выберите файл для %1 данных из клиента банка';uk='Виберіть файл для %1 даних з клієнта банку'"), Режим);
	ДиалогВыбора.ПредварительныйПросмотр     = Ложь;
	ДиалогВыбора.Расширение                  = "xml";
	ДиалогВыбора.ИндексФильтра               = 0;
	ДиалогВыбора.ПолноеИмяФайла              = ?(ПустаяСтрока(Элемент.ТекстРедактирования),
		?(Режим = НСтр("ru='выгрузки';uk='вивантаження'"), "1C_to_CB.xml", "CB_to_1C.xml"), Элемент.ТекстРедактирования);
	ДиалогВыбора.ПроверятьСуществованиеФайла = Ложь;
	
	Если ДиалогВыбора.Выбрать() Тогда
		Если Режим = НСтр("ru='загрузки';uk='завантаження'") Тогда
			Объект.ФайлЗагрузки = ДиалогВыбора.ПолноеИмяФайла;
		Иначе
			Объект.ФайлВыгрузки = ДиалогВыбора.ПолноеИмяФайла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПодключаемаяОбработкаПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Объект.ПодключаемаяОбработка) Тогда
		Объект.РасширениеФайлаИмпорта = ПолучитьФорматФайла(Объект.ПодключаемаяОбработка);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодключаемаяОбработкаПриИзменении(Элемент)
	ПодключаемаяОбработкаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Функция ПолучитьФорматФайла(ОбработкаПротокола)
	
	Если ЗначениеЗаполнено(ОбработкаПротокола) И ТИПЗНЧ(ОбработкаПротокола) <> ТИП("СправочникСсылка.СМП_УчетныеЗаписиБанков") Тогда
		Попытка
			ИмяФайла = ПолучитьИмяВременногоФайла("epf");
			ОбработкаОткр = ОбработкаПротокола.ХранилищеОбработки.Получить();
			ОбработкаОткр.Записать(ИмяФайла);
			ВнешняяОбработка = ВнешниеОбработки.Создать(ИмяФайла, Ложь);
			Формат = ВнешняяОбработка.ФорматФайла();
			УдалитьФайлы(ИмяФайла);
			Возврат Формат;
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	Возврат "xml";
	
КонецФункции


#КонецОбласти
